{"qpAyooApcDA": {"topic": "ModelFinder is much slower than PartitionFinder2", "initializeDate": "Jan 24, 2020, 8:51:19 AM", "timeStamp": "Mar 7, 2020, 8:27:28 AM", "content": ["I set up a ModelFinder analysis on my phylogenomic dataset that should mimic settings I used in PartitionFinder2. The PF2 analysis finished in 1.5 days using 72 cpus. The MF analysis, in contrast, was still running after 2 days and the estimated amount of time remaining kept increasing (> 2,000 hours). I have generally found the MF analysis available in IQTree to be much slower than PF2 and I am curious to know why that is and if there is a fix in the works or if I am setting up the analysis incorrectly. For some background, my dataset has 283 taxa, 694198 bp, and 5423 partitions. To reduce analysis time, I used the rclusterf algorithm and restricted the model to GTR+G only. Here is the exact execution script run in v1.6.12 on a cluster: iqtree -s aln.phy -spp aln-nodupes.part -m TESTMERGEONLY -rclusterf 10 -mset GTR+G -merit AICc -mrate G -nt 72 Any comments appreciated. Thanks, Michael ", "Hi Michael, It looks like there might be a mistake in your Modelfinder command line. From what I understand, -rclusterf is just a flag, and shouldn’t be followed by a number. I don’t know what happens when you follow it with a number, but given what you report I suspect ModelFinder might be ignoring the flag altogether. Maybe try this: iqtree -s aln.phy -spp aln-nodupes.part -m TESTMERGEONLY -rclusterf -mset GTR+G -merit AICc -mrate G -nt 72 and alternatively you could try this which should be very similar iqtree -s aln.phy -spp aln-nodupes.part -m TESTMERGEONLY -rcluster-max 5 -mset GTR+G -merit AICc -mrate G -nt 72 The latter will run the standard rcluster analysis, but only look at the top 5 potential pairs to merge. It should be fairly quick, and might help you figure out if it’s something intrinsic to ModelFinder being slower for some reason (which I think is relatively unlikely) or something that can be fixed by changing your command line. Rob You received this message because you are subscribed to the Google Groups \"IQ-TREE\" group. To unsubscribe from this group and stop receiving emails from it, send an email to iqtree+un...@googlegroups.com To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/0a71fc8f-a904-4b3f-8280-9434b7951f04%40googlegroups.com Rob Lanfear Division of Ecology and Evolution, Research School of Biology, The Australian National University, Canberra www.robertlanfear.com ", "Hi guys, Just to chime in. I recently used -rclusterf 10 and it seemed to work fine. Then again, there was nothing in the log file that said that ModelFinder just used to top 10% of candidates. Chris On Thursday, 23 January 2020 19:09:06 UTC-5, Rob Lanfear wrote: Hi Michael, It looks like there might be a mistake in your Modelfinder command line. From what I understand, -rclusterf is just a flag, and shouldn’t be followed by a number. I don’t know what happens when you follow it with a number, but given what you report I suspect ModelFinder might be ignoring the flag altogether. Maybe try this: iqtree -s aln.phy -spp aln-nodupes.part -m TESTMERGEONLY -rclusterf -mset GTR+G -merit AICc -mrate G -nt 72 and alternatively you could try this which should be very similar iqtree -s aln.phy -spp aln-nodupes.part -m TESTMERGEONLY -rcluster-max 5 -mset GTR+G -merit AICc -mrate G -nt 72 The latter will run the standard rcluster analysis, but only look at the top 5 potential pairs to merge. It should be fairly quick, and might help you figure out if it’s something intrinsic to ModelFinder being slower for some reason (which I think is relatively unlikely) or something that can be fixed by changing your command line. Rob On Fri, 24 Jan 2020 at 10:51, Michael Branstetter < mgbran...@gmail.com > wrote: I set up a ModelFinder analysis on my phylogenomic dataset that should mimic settings I used in PartitionFinder2. The PF2 analysis finished in 1.5 days using 72 cpus. The MF analysis, in contrast, was still running after 2 days and the estimated amount of time remaining kept increasing (> 2,000 hours). I have generally found the MF analysis available in IQTree to be much slower than PF2 and I am curious to know why that is and if there is a fix in the works or if I am setting up the analysis incorrectly. For some background, my dataset has 283 taxa, 694198 bp, and 5423 partitions. To reduce analysis time, I used the rclusterf algorithm and restricted the model to GTR+G only. Here is the exact execution script run in v1.6.12 on a cluster: iqtree -s aln.phy -spp aln-nodupes.part -m TESTMERGEONLY -rclusterf 10 -mset GTR+G -merit AICc -mrate G -nt 72 Any comments appreciated. Thanks, Michael You received this message because you are subscribed to the Google Groups \"IQ-TREE\" group. To unsubscribe from this group and stop receiving emails from it, send an email to iqt...@googlegroups.com To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/0a71fc8f-a904-4b3f-8280-9434b7951f04%40googlegroups.com ", "Thanks for the comments. I initially tried to run the command without the number after rclusterf, but I received an error message stating that it expected there to be a number. I did think this was odd, given that PF2 does not require such a number when using rclusterf. I will keep trying, but I am curious to know if it is a reasonable expectation that MF should be as fast or faster than PF2 with the same number of cpus. Also, if MF has been tested on large phylogenomic datasets and compared to PF2 in terms of performance and speed? Thanks, Michael --------------------------------------------------------- Michael Branstetter, PhD USDA-ARS Pollinating Insects Research Unit Utah State University 5310 Old Main Hill Logan, UT 84322-5310 (435) 797-2588 --------------------------------------------------------- To unsubscribe from this group and stop receiving emails from it, send an email to iqtree+un...@googlegroups.com To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/6077c882-1d1d-4289-8a65-6aca68f4b541%40googlegroups.com ", "Dear Michael, dear all, I think that providing a number to the rclusterf option is correct, in iqtree. I was also surprised how long my last rclusterf run took. It had about 260000 sites, 1300 data blocks and 135 taxa. So much smaller than your data set. (No Hymenoptera in fact.) It took almost exactly one month to complete on 50 cores. I did not compare this to PF2, but I was surprised that it took that long. Another point of interest: The time left during the merging phase increased almost steadily up to a maximum of about 6400 hours. Minutes after reaching that maximum, the merging phase successfully finished. I think the run time of the rclusterf simply cannot be estimated. It would be easier to estimate the time until the next merging step since for the current step, the number of remaining analyses is known. In an rcluster run (no f) the \"time left\" decreased to 0 and stayed there for days until it finished. Maybe this difficulty in estimating the remaining computation time could be pointed out somewhere. Best Christoph To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/CAJgYPPExc5BF4ZPaaPQmQV21eSX5UJ0mGMdfGWAOZ1ZnTLdLiw%40mail.gmail.com **************************************** Dr. Christoph Mayer Email: c.maye...@uni-bonn.de Tel.: +49 (0)228 9122 403 Zoologisches Forschungsmuseum Alexander Koenig - Leibniz Institut für Biodiversität der Tiere - Adenauerallee 160 53113 Bonn, Germany www.zfmk.de Stiftung des öffentlichen Rechts; Interimsdirektor: Prof. B. Misof Sitz: Bonn **************************************** ", "Hi All, Minh is on holiday at the moment, but when he's back he and I can sit down and work through these issues and differences in performance. We're preparing to release a new version of ModelFinder so these concerns are very timely! If anyone else has observations, this would be a good thread to raise/discuss them. Rob To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/754EBE7A-938B-4C17-886B-4FB2514C78CB%40uni-bonn.de ", "Hi Rob, I posted this before, but ModelFinder was taking a very long time on my unpartitioned alignment of about 2 million bp and 33 taxa. Because if this I simply compared GTR+R10 and GTR+I+G. Chris To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/CAGr%2BNmqmNEfzVj5%2B10ieWtdL7F3chNVJYCGtvE5ftpb%2BT_ZErw%40mail.gmail.com <{===================~~~~~~~~~~~ /\\ /\\ Christopher Blair, Ph.D. Associate Professor Department of Biological Sciences New York City College of Technology and Ecology, Evolution and Behavior PhD Program Graduate Center The City University of New York 285 Jay Street Brooklyn, NY 11201 CBl...@citytech.cuny.edu cbl...@gc.cuny.edu Website: https://sites.google.com/site/christopherblairphd/home Office: Academic Complex 501A; Ph: 718-260-5342 Lab: Academic Complex 401 ", "Dear Minh, there is another point I want to add to this discussion, since I feel that it could be linked to ModelFinder being slow on large data sets. I am using Version 1.6.12 since this is the last stable release. I am aware of the fact the 1.7 includes improvements of the merging. Anyway: A while ago I started a merging run with rcluster 10. Since it is slow I copied the folder including the model.gz file and started a run with rclusterf 10 which should be faster. iqtree says that it read the model.gz file, which is already 500 MB large. Even though it has read the model file, it started to recompute models for all data blocks. Even though I gave this job 56 cores it reports the model of a single data block only every few minutes. The pattern is the following: It writes the model.gz.tmp file, which takes about 4 minutes. Then it renames it to model.gz. Every time it finishes, it reports the result of exactly one model determination of a single data block. - In this way it takes very long to conduct the primary model determination for 1300 data blocks. - I wonder why it determines the models of the individual data blocks, since it should already have obtained them from the previous run when reading the model.gz file? It reported that it read this file and apparently it is writing this file to the disk constantly. (Of course I did not change the data files when starting the rclusterf run.) - Why does it only report the model for a single partition every 4 minutes. It could run 56 model determinations in parallel. Things might have changed in the beta and release candidate versions of iqtree? Best wishes and many many thanks in advance. Christoph To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/754EBE7A-938B-4C17-886B-4FB2514C78CB%40uni-bonn.de ", "Dear Minh, dear all, for my case I think I have solved the problem. I restarted a run with an existing huge model.gz file (about 500 GB) in a ModelFinder merge Analysis. Iqtree was running for 62 hours with little progress. Since I conjectured that writing the model.gz was the bottleneck, I rerun the analysis with the option -cptime 1000, which reduces the time intervals after which checkpointing data is written to the disc from 20 to 1000 seconds. The latter is about one quarter of an hour. This reduced the run time considerably: The model determination for the first 829 data blocks reduced from: 62h:5m:10s to 0h:4m:27s, which is a nice speedup I would say. This speedup will only be achieved if the model.gz file is very large. But for data sets with many data blocks this will be the case at some point. Maybe the default time intervals for writing checkpointing data is an overkill. Having checkpointing data every quarter of an hour should be more than sufficient. Best Christoph To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/C97BEC37-8D13-4735-9FD8-16E56DD7133F%40uni-bonn.de ", "To follow up on what Christoph said about the new version of IQTREE, I found that merging in IQTREE2.0-rc1 is much, much faster. In a merging analysis using 2.0-rc1, a nucleotide dataset with 1059 partitions using -m TESTNEWMERGEONLY -rcluster 10 -rcluster-max 1000 -nt 25 took 38 hours to complete. I didn't try this exact analysis in IQTREE 1.6.x, but similar ones were running for a month before I killed them and they still had >80 days left in the estimated time remaining. This is a great improvement, but I didn't see mention of improved merging in the IQTREE2 preprint on Biorxiv, so more info would be useful. Thanks, Matt Kweskin To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/6077c882-1d1d-4289-8a65-6aca68f4b541%40googlegroups.com You received this message because you are subscribed to the Google Groups \"IQ-TREE\" group. To unsubscribe from this group and stop receiving emails from it, send an email to iqt...@googlegroups.com To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/CAJgYPPExc5BF4ZPaaPQmQV21eSX5UJ0mGMdfGWAOZ1ZnTLdLiw%40mail.gmail.com **************************************** Dr. Christoph Mayer Email: c...@uni-bonn.de Tel.: +49 (0)228 9122 403 Zoologisches Forschungsmuseum Alexander Koenig - Leibniz Institut für Biodiversität der Tiere - Adenauerallee 160 53113 Bonn, Germany www.zfmk.de Stiftung des öffentlichen Rechts; Interimsdirektor: Prof. B. Misof Sitz: Bonn **************************************** You received this message because you are subscribed to the Google Groups \"IQ-TREE\" group. To unsubscribe from this group and stop receiving emails from it, send an email to iqt...@googlegroups.com To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/754EBE7A-938B-4C17-886B-4FB2514C78CB%40uni-bonn.de **************************************** Dr. Christoph Mayer Email: c...@uni-bonn.de Tel.: +49 (0)228 9122 403 Zoologisches Forschungsmuseum Alexander Koenig - Leibniz Institut für Biodiversität der Tiere - Adenauerallee 160 53113 Bonn, Germany www.zfmk.de Stiftung des öffentlichen Rechts; Interimsdirektor: Prof. B. Misof Sitz: Bonn **************************************** You received this message because you are subscribed to the Google Groups \"IQ-TREE\" group. To unsubscribe from this group and stop receiving emails from it, send an email to iqt...@googlegroups.com To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/C97BEC37-8D13-4735-9FD8-16E56DD7133F%40uni-bonn.de **************************************** Dr. Christoph Mayer Email: c...@uni-bonn.de ", "Dear All, Thanks for the discussions! I will look through these once back in about a week. Quick comments about: The model determination for the first 829 data blocks reduced from: 62h:5m:10s to 0h:4m:27s, which is a nice speedup I would say. Yes indeed the default checkpoint time is too small for very large data set like this. So Christoph nicely pointed out that one should increase this with -cptime option to reduce the bottleneck of writing the checkpoint file. To follow up on what Christoph said about the new version of IQTREE, I found that merging in IQTREE2.0-rc1 is much, much faster. In a merging analysis using 2.0-rc1, a nucleotide dataset with 1059 partitions using -m TESTNEWMERGEONLY -rcluster 10 -rcluster-max 1000 -nt 25 took 38 hours to complete. I didn't try this exact analysis in IQTREE 1.6.x, but similar ones were running for a month before I killed them and they still had >80 days left in the estimated time remaining. This is a great improvement, but I didn't see mention of improved merging in the IQTREE2 preprint on Biorxiv, so more info would be useful. This is actually a new (unpublished) feature in v2.0, where we introduce several heuristics to speed up this process. We’re preparing ModelFinder2 ms about this, so more detailed descriptions will follow in the next few months. Cheers, Minh To unsubscribe from this group and stop receiving emails from it, send an email to iqtree+un...@googlegroups.com To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/4bc97bec-05fb-40cb-9b35-a751e2d178f2%40googlegroups.com ", "Dear Minh, I would like to suggest I simple default value for the -cptime option. Most users will never look at this option, so a better default value would be good to have. Some thoughts: For large data sets which run for many days, a checkpointing ever few hours is fully sufficient. What about: cptime default parameter = number of datablocks * 4. For 20 data blocks this is 80 or about 1.3 Minutes. For 1000 data blocks this is 4000s or about 1h. For 2000 data blocks this is 8000s or about 2h. Etc. Best Christoph To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/E84AAA28-ECDB-4C02-867B-09F09338EC3B%40univie.ac.at **************************************** Dr. Christoph Mayer Email: c.maye...@uni-bonn.de ", "Dear Minh, I have now experienced the ModelFinder speedup available in 2.0-rc1, and it seems to be a major improvement, but I am confused now as to how to setup the analysis correctly. It appears that the analysis options have changed compared to 1.6.x. Could you tell me how to run a merge only analysis that mimics PartitionFinder2. Specifically, I would like to do one run that only uses GTR+G, rclusterf, and AICc. I thought I setup the analysis correctly, but the output suggests that the program is using GTR+I+G rather than GTR+G only. Here are the options I used: /home/michael.branstetter/downloads/iqtree-2.0-rc1-Linux/bin/iqtree -s aln.phy -spp aln.part -m TESTMERGEONLY -rclusterf 10 -mset GTR+G -merit AICc -mrate G -nt 72 -cptime 3600 When I look at the help information for v2.0-rc1, it seems to me that the merge options should be run separately from the model test options, but I can't quite figure out how to run the analysis correctly. I'm also interested in doing a run that would allow for all iqtree models to be tested. All help appreciated. Thanks. Best, Michael --------------------------------------------------------- Michael Branstetter, PhD USDA-ARS Pollinating Insects Research Unit Utah State University 5310 Old Main Hill Logan, UT 84322-5310 (435) 797-2588 --------------------------------------------------------- To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/E84AAA28-ECDB-4C02-867B-09F09338EC3B%40univie.ac.at ", "Michael, I suggest trying your partition file in nexus format if it’s not already. That was the only way I was able to get merging to work with iqtree2-rc1. Matt ", "The merging worked for me using a raxml-style format file, but iqtree used the wrong model. What settings did you use to start the analysis? Best, Michael --------------------------------------------------------- Michael Branstetter, PhD USDA-ARS Pollinating Insects Research Unit Utah State University 5310 Old Main Hill Logan, UT 84322-5310 (435) 797-2588 --------------------------------------------------------- ", "I believe I made an error suggesting that nexus vs raxml style partitions make a difference. In some early attempts, I thought that was the case, but it was probably user error. I’m re-running a job with raxml-style partitions and so far the log looks about the same as when I used nexus. If there is a difference in the results, I’ll follow up. This is the command I used: iqtree-2.0-rc1-Linux/bin/ iqtree -s alignment.phy -p partitions.nexus -m TESTNEWMERGEONLY -nt 15 -rcluster 10 -rcluster-max 1000 -pre TESTNEWMERGE -cptime 1800 ", "Hi Christoph, In version 2.0 we already implemented a better checkpointing automatically adapted to the dataset size. It will measure the time needed to write the checkpoint file, say = x. The waiting time to the next checkpoint will be set to max(60 sec, x*20). That way, IQ-TREE will never spend more than 5% of the runtime for checkpointing. Does that make sense? Cheers Minh To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/6A3FF99E-B483-4DA3-BCE8-D7E1B08E87A5%40uni-bonn.de ", "Hi Michael, In iqtree v2 there are two new options to control the model and rate for the merging phase. Here is the relevant help usage, which you can see by running iqtree -h: PARTITION-FINDER: --merge Merge partitions to increase model fit --merge greedy|rcluster|rclusterf Set merging algorithm (default: rclusterf) --merge-model 1|all Use only 1 or all models for merging (default: 1) --merge-model STR,... Comma-separated model list for merging --merge-rate 1|all Use only 1 or all rate heterogeneity (default: 1) --merge-rate STR,... Comma-separated rate list for merging --rcluster NUM Percentage of partition pairs for rcluster algorithm --rclusterf NUM Percentage of partition pairs for rclusterf algorithm --rcluster-max NUM Max number of partition pairs (default: 10*partitions) The two relevant options are --merge-model and --merge-rate. You can set: --merge-model all --merge-rate all to revert the old (slow) behaviour of considering all models and rates. Or you can do: --merge-model GTR --merge-rate G to only consider GTR+G. We’re still in the process of preparing ModelFinder2 ms. Full details will follow. Cheers, Minh To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/CAJgYPPHuWogZExKAZnWfg6-oZiNO7BEvUenNKo7d0232D8%2B3Tg%40mail.gmail.com ", "Hi Minh, Thanks for the help. I had checked the help information, but what remains unclear to me is the relationship between the \"-m\" and \"--merge\" settings, since these seem to be separate parameters in iqtree2. When I attempted a run using \"--merge rclusterf\" only, without the \"-m\" option, iqtree2 did not perform the MF analysis, it just did a tree search. I have only been able to get the MF analysis to work when I use the old \"-m TESTMERGEONLY\" setting. It does appear that doing \"m TESTMERGEONLY\" followed by \"--merge-model GTR --merge-rate G\" produces the correct outcome, limiting the merge model to GTR+G only. However, after the merging, it tests all available models across the partitions. Do I need to set \"-mset\" and \"mrate\" in addition to \"merge-model\" and \"merge-rate\"? And what about \"--merge rclusterf\" versus \"-rclusterf 10\"? Do I need both of these or just one? Perhaps I just need to wait for the MF2 paper/documentation to get the answers I need, but I would appreciate the any clarity you can provide. Thanks, Michael --------------------------------------------------------- Michael Branstetter, PhD USDA-ARS Pollinating Insects Research Unit Utah State University 5310 Old Main Hill Logan, UT 84322-5310 (435) 797-2588 --------------------------------------------------------- To view this discussion on the web visit https://groups.google.com/d/msgid/iqtree/6762F488-E24B-416C-99D3-D9A20403AA5F%40univie.ac.at "]}}